Mentioned this in Slack @jufemaiz  but another potential workaround (assuming you know it's safe for your configuration) while waiting for 0.14 would be running the plan or apply without a refresh. 

```
~/r/v/tf-for_each-data-invalid-index-poc ❯❯❯ terraform plan -var-file=values.tfvars -refresh=false             ✘ 1 
provider.aws.region
  The region where AWS operations will take place. Examples
  are us-east-1, us-west-2, etc.

  Enter a value: us-east-1


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.sns_publish["first"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_publish"  {
      ~ id      = "2490061105" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:446075195327:first"
                      - Sid       = "S3PublishToTopic"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
            actions       = [
                "SNS:Publish",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:aws:sns:us-east-1:446075195327:first",
            ]
            sid           = "S3PublishToTopic"

            principals {
                identifiers = [
                    "*",
                ]
                type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.sns_publish["second"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_publish"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "S3PublishToTopic"

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3_bucket_notification.this will be updated in-place
  ~ resource "aws_s3_bucket_notification" "this" {
        bucket = "tf-data-invalid-index-poc-rtizzy"
        id     = "tf-data-invalid-index-poc-rtizzy"

        topic {
            events        = [
                "s3:ObjectCreated:*",
            ]
            filter_prefix = "first"
            filter_suffix = ".csv"
            id            = "tf-s3-topic-20201110141607149100000001"
            topic_arn     = "arn:aws:sns:us-east-1:446075195327:first"
        }
      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "second"
          + filter_suffix = ".json"
          + topic_arn     = (known after apply)
        }
    }

  # aws_sns_topic.this["second"] will be created
  + resource "aws_sns_topic" "this" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "second"
      + policy = (known after apply)
    }

  # aws_sns_topic_policy.sns_publish["first"] will be updated in-place
  ~ resource "aws_sns_topic_policy" "sns_publish" {
        arn    = "arn:aws:sns:us-east-1:446075195327:first"
        id     = "arn:aws:sns:us-east-1:446075195327:first"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:446075195327:first"
                      - Sid       = "S3PublishToTopic"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_sns_topic_policy.sns_publish["second"] will be created
  + resource "aws_sns_topic_policy" "sns_publish" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ s3_sns_notification_details = {
        "first"  = {
            prefix = "first"
            suffix = ".csv"
        }
      + "second" = {
          + prefix = "second"
          + suffix = ".json"
        }
    }

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

This appears to complete successfully. 

